# pandas DataFrame 쿼리


DataFrame에서 데이터의 일부를 반환하는 것을 데이터 슬라이스 또는 다이싱이라고합니다.

Pandas DataFrame을 쿼리하는 방법에는 여러 가지가 있습니다. 시작하는 데 도움이되는 몇 가지 방법이 있습니다.

In [1]:
import pandas as pd

In [3]:
airports = pd.DataFrame([
                        ['Seatte-Tacoma', 'Seattle', 'USA'],
                        ['Dulles', 'Washington', 'USA'],
                        ['London Heathrow', 'London', 'United Kingdom'],
                        ['Schiphol', 'Amsterdam', 'Netherlands'],
                        ['Changi', 'Singapore', 'Singapore'],
                        ['Pearson', 'Toronto', 'Canada'],
                        ['Narita', 'Tokyo', 'Japan']
                        ],
                        columns = ['Name', 'City', 'Country']
                        )
airports

              Name        City         Country
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

## 한 열 반환하기
반환 할 열 이름을 지정하세요.
* *DataFrameName*['*columnName*']

In [4]:
airports['City']

0       Seattle
1    Washington
2        London
3     Amsterdam
4     Singapore
5       Toronto
6         Tokyo
Name: City, dtype: object

## 여러 열 반환하기
반환하려는 열 리스트를 제공하세요.
* *DataFrameName*[['*FirstColumnName*','*SecondColumnName*',...]]

In [5]:
airports[['Name', 'Country']]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan

## 특정 행과 열을 반환하기 위한 *iloc* 사용
**iloc**[*rows*,*columns*]는 행 및 열 인덱스 위치별로 행 또는 열 그룹에 액세스 할 수 있습니다.

반환할 특정 행과 열을 지정합니다.
* 첫 번째 행은 0 번 행입니다.
* 첫 번째 열은 0 번 열입니다.

In [8]:
# 세 번째 행과 열의 값을 반환합니다.
airports.iloc[2,2]

'United Kingdom'

In [7]:
# 첫 행과 열의 값을 반환합니다.
airports.iloc[0,0]

'Seatte-Tacoma'

In [9]:
airports.iloc[:,:]

              Name        City         Country
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

*의 값:*은 모든 행과 열을 반환합니다.

당신은 행의 범위나 열의 범위를 요청할 수 있습니다.
* [x:y]는 x부터 y까지 행이나 열을 반환합니다.

In [10]:
# 모든 열을 출력하고 처음 두 행을 반환합니다.
airports.iloc[0:2,:]

            Name        City Country
0  Seatte-Tacoma     Seattle     USA
1         Dulles  Washington     USA

In [11]:
# 처음 두 열을 출력하고 모든 행을 반환합니다.
airports.iloc[:,0:2]

              Name        City
0    Seatte-Tacoma     Seattle
1           Dulles  Washington
2  London Heathrow      London
3         Schiphol   Amsterdam
4           Changi   Singapore
5          Pearson     Toronto
6           Narita       Tokyo

열의 리스트나 행의 리스트를 요청할 수 있습니다.
* [x,y,z] 은 x,y,z의 행이나 열을 반환합니다.

In [12]:
airports.iloc[:,[0,2]]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan

## *loc*를 이용하여 이름으로 특정 열을 지정하기
열 위치 대신 열 이름을 나열하려면 **iloc** 대신 **loc**를 이용하세요.

In [13]:
airports.loc[:,['Name', 'Country']]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan